# Домашнє завдання:
# 1. Використовуючи словник, напишіть програму, яка виведе на екран назву дня тижня за номером.
# Наприклад, 1 - "Monday".
week = {
    1 : "Monday – /’mun.dei/ — Понедельник",
    2 : "Tuesday – /’tiu:z.dei/ — Вторник",
    3 : "Wednesday – /’wenz.dei/ — Среда",
    4 : "Thursday – /’thurz.dei/ — Четверг",
    5 : "Friday – /’frai.dei/ — Пятница",
    6 : "Saturday – /’sa.ta.dei/ — Суббота",
    7 : "Sunday – /’sun.dei/ — Воскресенье"
}
# day = int(input("input day number"))
day =1
print(week.get(day , "incorrect day"))
# 2. Опишіть кота (домашня тварина) на основі словника.
cat = {
    "color": "red",
    "paws": 4,
    "eye color": "blue"
}
print(cat)
# 3. Напишіть програму, яка читає рядок тексту з клавіатури і виводить на екран статистику, скільки разів яка літера зустрічається в цьому рядку.
# Наприклад, для рядка «Hello world» ця статистика виглядає так: «H» - 1, «e» - 1, «l» - 3 і т.д.
text = "hello world"
t = {}
#пробел считаем так же за символ
for i in text:
    if None == t.get(i):
        t[i] = text.count(i)
print(t)
# 4. Напишіть програму, яка прочитає два рядки тексту з клавіатури і виведе на екран літери, які є одночасно і в першому, і в другому рядку.
# Наприклад, для рядків «Hello» та «World» на екрані мають бути літери «l» та «o».
str1 = "Hello"
str2 = "Welcom"
l1 = set(str1)
l2 = set(str2)
print(l1 & l2)

# 5. Напишіть програму, яка згенерує два списки. Один із числами кратними 3, інший із числами кратними 5.
s1 = [i *3 for i in range(1,100)]
s2 = [i *5 for i in range(1,100)]
print(s1)
print(s2)
# 6. Створіть список із числами, які є в обох списках.
m1 = set(s1)
m2 = set(s2)
m3 = m1 & m2
li = list(m3)
print(li)
