# Домашнє завдання:
# 1. Дано число (чотиризначне). Перевірити, чи воно є «щасливим квитком».
# Примітка: щасливим квитком називається число, у якому, при парній кількості цифр, сума цифр його лівої половини дорівнює сумі цифр його правої половини.
# Наприклад, 1322 є щасливим квитком, тому що 1 + 3 = 2 + 2.
#number = int(input('Введите парное число='))
number =1212
x = []
x = list(map(int, str(number)))
len_number = len(str(number))
if len_number % 2:
    print('Число не парное, введите парное')
else:
    print ('Введено парное число', number)
    len_number_popolam = len_number / 2
    print( "число счастливое" if sum(x[0:int(len_number_popolam)],0) == sum(x[int(len_number_popolam):],0) else "не счастливое")

# 2. З клавіатури вводиться число (шестизначне). Перевірити, чи воно є паліндромом.
# Примітка: Паліндром називається число, слово або текст, які однаково читаються зліва направо і справа наліво.
# Наприклад, це числа 143341, 5555, 7117 і т.д.

#number = int(input('Введите 6 значное число='))

number = 123321
x = list(map(int, str(number)))
print(x)
print(x[::-1])
print("yes Паліндром" if x == x[::-1] else "no Паліндром")

# 3. Дано коло з центром на початку координат та радіусом 4. Користувач вводить з клавіатури координати точки x та y.
# Написати програму, яка визначить, лежить ця точка всередині кола чи ні.
R = 4
x = int(input("x="))
y = int(input("y="))
print( "всередині" if x**2 + y**2 <= R**2 else "not всередині")


