# Домашнє завдання:
# 1. Існують такі послідовності чисел:
# 0,2,4,6,8,10,12
# 1,4,7,10,13
# 1,2,4,8,16,32
# 1,3,9,27
# 1,4,9,16,25
# 1,8,27,64,125
# Реалізуйте програму, яка виведе наступний член цієї послідовності (або подібної до них) на екран.
# Послідовність користувач вводить з клавіатури у вигляді рядка. Наприклад, користувач вводить рядок 0,5,10,15,20,25
# та відповіддю програми має бути число 30.
def fun1(*args):
    # print(args)
    r = []
    for i in range(0, len(args)-1):
        r.append(args[i+1] - args[i])
    # print("r",r)
    # print(args[-1])
    if r[0] == r[-1]:
        return args[-1] + r[0]
    else:
        e = []
        for i in range(0, len(r) - 1):
            e.append(r[i + 1] - r[i])
        if e[0] == e[-1]:
            return args[-1] + r[-1] + e[-1]
    if args[len(args)-2] == args[-1]/2:
        return args[-1] * 2

# x = (1,4,9,16,25)
print("one: ", fun1(1,4,9,16,25))
print("two: ", fun1(0,2,4,6,8,10,12))
print("three: ", fun1(1,2,4,8,16,32))

# 2. Число-паліндром з обох сторін (справа ліворуч і ліворуч) читається однаково.
# Найбільше число-паліндром, одержане множенням двох двозначних чисел: 9009 = 91 × 99. Знайдіть найбільший паліндром,
# одержаний множенням двох трицифрових чисел. Виведіть значення цього паліндрому і те, vyj;tyyzv(множенням) яких чисел він є.

# допускаю что воводяться полидромі 6 значные и среди них ищу максимальное.....
def fun2(**kwargs):
    # print(kwargs)
    max_l = {'name': '', "max": 0}
    for key, index in kwargs.items():
        # print(key)
        max_pol = (index // 1000) * (index % 1000)
        if max_pol > max_l['max']:
            max_l['name'] = str(key)
            max_l['max'] = max_pol
    return max_l

print("max polidrom: ", fun2(pol1=123321, pol2=124421))
